/*:
 ## 总结
 你已经在为 QuestionBot 提供大脑方面做了很多努力，并且已经知道 playground 在不受干扰地处理单个函数方面非常有用。
 
 本课的最后部分是将你在上一页中构建的新函数拿过来并放入 app 中。
 
 有关执行此操作的指示，请参阅指南中的“QuestionBot”一课。*/
/*:
 
 _Copyright © 2017 Apple Inc._
 
 _特此授予任何人免费获取本软件及相关文档文件（下文简称“本软件”）副本的权利，允许其无限制地处理本软件，包括但不限于使用、复制、修改、合并、发布、分发、再许可和/或出售本软件副本的权利，并允许本软件的合法用户这样做，但须符合以下条件：_
 
 _上述版权声明和本许可声明应包含在本软件的所有副本或主要部分中。_
 
 _本软件按其现状提供，不作任何明示或默示担保，包括但不限于对适销性、特定用途的适用性和不侵权的保证。在任何情况下，作者或版权所有者均不对因合同、侵权或其他由于使用或处理本软件而引起或与其相关的任何索赔、损害或其他责任负责。_
 */
//:[上一页](@previous)  |  第 7 页，共 7 页
