/*:
 ## 列表
 
 人们总是使用列表。你可能有一个待办事项列表、愿望列表、iTunes 播放列表，甚至遗愿列表。列表非常有用，在编程中也常会用到它们。
 
 你在学习字符串时，已经在一些练习中创建了事物列表。你通过使用 `\n` 换行字符将多个字符串连接在一起，来制作列表。
 
 ```
 (示例): 
 let shoppingList = "鸡蛋" + "\n" + "西红柿" + "\n" + ...
 ```
 
 这些代码会提供一个列表，并会清楚地显示在屏幕上，但是除此之外，再没有其他太大的用处。想一想还可以使用列表来做的事情：

 - 如何在列表的每个成员上调用函数而不用全部重新输入函数？
 - 如何确认是否已向列表添加了一些内容？
 - 如果列表增加到了数以百计的项目，能否轻易地移除其中的“西红柿”？
 - 如果列表不是由 `String` 值，而是由其他值（例如，要加在一起的价格列表）组成的怎么办？
 - 第一件事是什么？最后一件事呢？第 24 件事呢？
 - 有多少件事情？
 - 可以如何重新安排列表？

 在 Swift 中，列表称为“数组”。
 
  想一想你用过的 iOS app，哪个里面有需要滚动查看的事物列表。这样的 app 几乎全部使用数组。
  
 在本课中，你将学习如何创建和使用数组。

第 1 页，共 17 页  |  [下一页：数组字面量](@next)
*/
