/*:
 ## 阅读适合的手册
 
 弹出窗口和“Quick Help”检查器从相同的来源获取信息：为该特定 API 提供的文档。
 
 使用弹出窗口或“Quick Help”检查器底部的链接可以访问完整的文档：
 
 ![文档链接](LinkToDocs.png)
 
 也可以使用 Xcode 菜单的“Window”>“Documentation and API Reference”直接访问文档。这会打开一个文档查看器窗口。
 
 - callout(Exercise): (练习):\
 依照上面的指示打开文档查看器，并使用该窗口顶部的搜索栏来搜索 `String`。查看一些关于 `String` 类型的文档。
 
 _搜索结果应该如下所示，选择第一项来查看 `String` API 的文档：_
 
 ![String 的搜索结果](StringSearch.png)
 
 >(注):  文档涵盖_方方面面_，可能看起来非常复杂。你并不需要阅读、理解或记住全部内容，这要比你阅读、理解和记住全部维基百科还要多。它只是在你需要时，为你提供所需的信息。
 
 接下来，我们来学习在文档中查看所声明类型的两种最常见方法。
*/
//: [上一页](@previous)  |  第 11 页，共 17 页  |  [下一页：类和结构](@next)
