/*:
 ## 恼人的更改
 
 你可能经历过事情发生变化时所产生的混乱。
 
 想象一下，你约好要在晚上 8 点与六个朋友一起看电影。
 
 你收到一条信息说计划变了，现在改在晚上 9 点在另外一家电影院看另外一场电影。
 
 过了一会儿，你又收到一条信息说计划又变了。现在，你要去你朋友家并在那里看电影。时间改在下午 6 点，而且你要定披萨。
 
 然后，你又收到一条信息说改成去另外一位朋友家，时间改成下午 6 点半。
 
 - experiment:(体验):  \
 经过这几次三番的变化，最后有可能每个人都会在正确的时间出现在正确的地点吗？\
\
如果计划没有发生变化，出现差错的可能性会不会更小呢？
 
 不管何时进行更改，都有可能导致这些通过信息进行沟通的人由于最后使用了旧的信息而出现差错。
 
 在编程中也是如此。如果可以定义常量，就要确保该值永不改变。这样，你程序的其他部分就没有机会偏离轨道或使用旧值。
 
 有时确实需要使用变量。程序运行过程中，某些事物确实会变化。在编程中，能够改变的事物称为“可变 (mutable)”，来自于“变化 (mutate)” 这个词，意思是“会改变”。
 
 不能改变的事物称为“不可变 (immutable)”。根据经验，如果某个事物不需要改变，那么使用常量一定会降低发生混乱和错误的几率。
 
 说到错误，我们接下来继续学习使用常量和变量时常见的错误。
 */
//: [上一页](@previous)  |  第 6 页，共 13 页  |  [下一页：尝试更改常量](@next)
