//: ## 什么是 Playground？
//: playground 是一个可以随意尝试各种代码，并且能够立即看到结果的场所。playground 中既包含说明概念的部分（例如，此文本），也包含可更改的实时代码。
//:
//: 可编写的最简单_“代码行”_就是一个数字：
765
//:👆你注意到上面的数字有什么不同了吗？
//: 这种文本样式是*“可编辑的代码”*，表示你可以编写或更改这些代码来实现所需的操作。
//:
//: 对于负数，使用减号：
-1200
/*:
你注意到这些数字也会显示在右侧的灰色区域中吗？它们是怎样显示的？ 👉

该区域称为_“结果边栏”_。添加或更改代码时，playground 会重新运行代码并更新边栏中的结果。
 
- experiment:(体验): 
    - 点按代码行，将光标移到那里。
    - 键入文本，开始编辑代码。
    - 更改几次数字。
    - 添加一些新数字，一行放置一个数字。\
请注意，每次更改时，都会在边栏中更新结果。

接下来，试试看将结果边栏放在哪里更便于使用吧。
 
 [上一页](@previous)  |  第 2 页，共 7 页  |  [下一页：计算](@next)
*/
