/*:
 ## 时光逆旅
 你现在已经在 Xcode 中编写了几个项目，但是你可能已经注意到，在默认模式下，Xcode 看起来与当下常见的代码形象不太一样。

 你使用 playground 时看到的代码：
   ![以白色背景和五颜六色的文本书写的代码示例](NowTimeyCode.png)
 无惧岁月变迁的程序员的屏幕上显示的代码：
   ![以黑色背景和绿色文本书写的代码示例](OldTimeyCode.png)
 
 代码示例的运行方式相同，结果也完全一样，那电影和节目中为什么仍然使用黑底绿字的样式来显示代码呢？

 这就要追溯到人们最初用来进行编程的屏幕了；[待办事项：调查实际原因]。

 现如今，有些人使用黑色背景，是因为眼睛更容易适应黑色（尤其是在黑暗的房间中）；其他人也使用黑色背景，是因为这会让他们想起当年的编程勇士们曾经意气风发的那个年代。

 当然，只要有助于你编写出最优秀的代码，你可以使用任何颜色模式，但是这个 playground 项目要带你走一趟时光的逆旅。为了进入正确的思维模式，请前进到下一页并遵循指示更新 Xcode 颜色模式。

 我们将回到过去！

 */

