//: ## 程序员的行业术语
//: 一名 app 开发者不仅仅要知道如何在 Xcode 中进行键入。程序员们需要互相合作，共同讨论如何解决问题并相互进行说明。因此，了解程序员所使用的术语至关重要。
//:
//: 在本课程中，你除了学习如何编写代码和创建 app 之外，还将学习与其他开发者谈论代码时需要使用的术语。
//:
//: 例如，“代码行”的正式名称叫做“语句”。
//:
//: 此 playground 中已经出现过术语“常量”和“标识符”。仔细看看下面的语句，再学习一些术语。
let numberOfDogs = 101
//: 在 Swift 中，定义常量称为“声明”常量。因此，上述语句称为“声明”。“我声明名称 `numberOfDogs` 具有值 `101`！”。
//:
//: 单词 `let` 是一种“关键字”。在 Swift 中，关键字具有特殊意义，不能用作名称。`let` 关键字用于声明常量。慢慢地，你会接触到更多 Swift 关键字。
//:
//: 语句的 `= 101` 部分是为常量进行“赋值”，其中等号 `=` 称为“赋值运算符”。
//:
//: - note:
//:(注):  
//:不要急于马上记住每一个新术语，你可能会吃不消的。本课程后续部分的内容中还会使用到这些术语，你可以视需要随时查看《学生指南》中的“术语表”，重温这些概念。
//:
//:[上一页](@previous)  |  第 8 页，共 14 页  |  [下一页：总结](@next)
