/*:
 ## 数组字面量
 
 你已经使用字面量值在代码中直接创建了字符串、数字和布尔值。你还可以使用“数组字面量”在代码中直接创建数组。

 数组字面量是项目列表，以逗号分隔，所有内容都位于方括号内：
*/
let devices = ["iPhone", "iPad", "iPod", "iMac"]
/*:
 在结果边栏中将鼠标悬停在列表中，并使用圆形的“Show Result”按钮，将数组添加到 playground 中。在内联视图中，你可以看到数组中的每个项目都有一个号码，从零开始，如下所示：
 
`0 "iPhone"`\
`1 "iPad"`\
`2 "iPod"`\
`3 "iMac"`
 
 - experiment:(体验):  更改上述 `devices` 数组字面量中项目的顺序或号码。请注意，结果查看器中的项目顺序始终与它们在字面量中的输入顺序相一致。
 
 
 - experiment:(体验):  在下面创建一个名为 `highScores` 的新常量，并为它赋予包含 10 个号码的列表的数组。
 */
// Define highScores array below

/*:

 
 继续学习下一页，我们来找出这些号码的意义。
 
[上一页](@previous)  |  第 2 页，共 17 页  |  [下一页：索引](@next)
*/
