/*:
 ## 更多比较
 
 比较运算符 `==` 非常有用，但是如果必须逐个检查是否每个数字都相等，那么很快就会变得乏味。幸运地是，可以在数字之间进行更多的比较：
 */
// Less than
1 < 2
2 < 2
3 < 2

// More than
1 > 2
2 > 2
3 > 2
/*:
 有些比较使用两个紧挨在一起的符号，组合起来表达一个意思：
 */
// Not equal
1 != 2
2 != 2
2 != 1

// Less than or equal to
2 <= 2
1 <= 2
3 <= 2

// More than or equal to
1 >= 2
2 >= 2
3 >= 2

/*:
 检查结果边栏，看看以上比较的结果 👉。

 - note:(注):  一种有效的记忆 `>` 和 `<` 含义的方法就是将符号想象成贪吃的大嘴，总是吃较大的值：\
 🎂>🍰


 - callout(Exercise): (练习):\
 自己练习编写一些比较语句。如果尝试比较非整数类型（如倍精度或字符串）会出现什么情况？
*/




//: 在下一页中，我们来学习如何在代码中添加决策点。
//:
//: [上一页](@previous)  |  第 4 页，共 13 页  |  [下一页：条件](@next)
