/*:
 ## 曾经的美好时光
 
 在此 playground 中，你将加入一项属于新程序员的特殊传统，这一传统自上世纪七十年代起延续至今。但是在此之前，你需要先学习一些东西。首先，要学习如何在 Xcode 中配置编程环境。
 
 你已经体验过几个项目，所以可能已经注意到，你的代码看起来与当下常见的代码形象不太一样。你在 playground 中看到的代码是这样的：
 
 ![以白色背景和五颜六色的文本书写的代码示例](NowTimeyCode.png)
 
 你在电影（很可能是老电影）中程序员屏幕上看到的代码可能是这样的：
 
 ![以黑色背景和绿色文本书写的代码示例](OldTimeyCode.png)
 
 以上代码示例完全相同，它们的运行方式和结果也都一样。那么，黑底绿字样式是怎么回事？
 
 这要回溯到上世纪七、八十年代，当时的电脑显示器是单色的，只能显示一种颜色，通常是黑色屏幕绿色字。
 
 而如今，一些程序员仍会选择黑色背景，这是因为眼睛更容易适应黑色（尤其是在黑暗的房间中），也可能只是因为他们喜欢这种怀旧风格。
 
 当然，只要有助于你编写出最优秀的代码，你可以使用任何颜色模式。前进到下一页，遵循指示更改 Xcode 颜色模式。
 
第 1 页，共 11 页  |  [下一页：更改颜色](@next)
 */
