//: ## 宠物问题
//: 设想你的朋友正在筹划一场宠物秀，需要跟踪这场秀中每种动物的数量。
//: 你的朋友还需要知道这场秀中动物的总数以及哺乳动物的总数。
//:
//: 现在，设想你手上只有一台安装了 Xcode 的笔记本电脑。也许你可以使用 playground 来助你朋友一臂之力。
//:
//: 你可以利用目前为止所学的内容，通过注释和数字跟踪每种动物的数量，如：
// Number Of Dogs
5

// Number Of Cats
4

// Number Of Turtles
3
//: 然后，你可以将这些数字复制到新的代码行，让 playground 为你进行计算，如：
// Total Number Of Animals
5 + 4 + 3

// Total Number Of Mammals
5 + 4
//: - experiment: 
//:(体验):\
//:一周下来，你将获得这场秀中宠物的更多信息。\
//:更改上述代码可更新总数。
//:
//: 例如，如果又有人带来一只狗，那么需要将`“Number Of Dogs”`从 `5` 更改为 `6`，并在该数字出现的所有地方（`“Total Number Of Animals”`和`“Total Number Of Mammals”`），将 `5` 更改为 `6`。
//:
//: 如果有人带来一种新的动物，那么可以使用与其他动物相同的计数模式。在一行上添加新注释（例如，`// Number Of Hamsters`），在下一行上添加数量。不要忘了更新总数。
//:
//: - 又有人带来一只狗。
//: - 其中一只乌龟生病了，不能来了。
//: - 又有人带来一只猫。
//: - 有人带来一只仓鼠（哺乳动物）。
//:
//:  有更好的方法来解决这个问题吗？思考一下，然后继续。
//:
//:[上一页](@previous)  |  第 2 页，共 14 页  |  [下一页：宠物问题总结](@next)
