/*:
 ## 练习：目标

想一个你的目标，你每天都可衡量该目标的进度，无论是在练习上花费的时间、向朋友发送的照片数、睡觉的时间还是写小说的字数都可以。

 - callout(Exercise): (练习):\
 创建一个数组字面量，其中包含每日活动样本数据的 20 到 25 个项目。这可能类似 `let milesBiked = [3, 7.5, 0, 0, 17 ... ]`。随意编造或装点数字，但要确保你输入的条目有的在你的目标之上，有的在你的目标之下，还有的正好符合你的目标。提示：确保为你的数据选择正确的数组类型，无论是 `[Double]` 还是 `[Int]`。
*/

//: - callout(Exercise): (练习):\
//: 编写如下函数：使用每日数字作为自变量，并以字符串返回信息。该函数应该基于该数字距离目标的远近来返回不同的信息。在你的响应中，你可以像你所希望的那样雄心勃勃且富有创造力，但一定要根据你的每日进度至少回复两条不同的信息！



//: - callout(Exercise): (练习):\
//: 编写 `for...in` 循环，对你的样本数据进行循环，调用函数以为每个项目获取适当的信息，并向控制台打印信息。





//: [上一页](@previous)  |  第 16 页，共 17 页  |  [下一页：练习：筛选信息](@next)
