/*: 
 ## 练习：安排早晨的各项事务
 
 早晨出门之前有很多事情要做。这个练习将帮助你优化日常事务。
 
 - callout(Exercise): (练习):   为早晨出门之前要做的每项活动创建常量：例如 `brushTeeth`、`uploadPhotos`、`chooseClothes`、`shower`、`goJogging`、`finishHomework`、`fixLunch` 等。想一下每项活动通常花费多长时间，然后将该值赋给每个常量。
 */
let brushTeeth = 3
// Add more here...

//: - callout(Exercise): (练习):   加总这些常量，得出所有活动的总时间。尝试调整值或添加更多活动，直到总时间相当接近于平日里实际的准备时间。



//: - callout(Exercise): (练习):  重新加总这些常量，但这次分组进行：一个组包含必须做的事，另一个组包含你想要做的事。\
//:\
//:如果还有既不必做也不想做的事，可再建立一个组，也进行加总求和。 \
//:\
//:为每个组创建新的常量。



/*:
 如果稍微调整不同活动的时间长度，看看总准备时间会发生什么变化。洗澡要减少到多长时间，才能有更多的时间给朋友发短信？或者可以有更多时间出去跑步？如果你要尽情做最喜欢的那些活动，还需要多少时间？
 
 不断更改数字，直到设计出你理想的早晨。你需要做哪些改变才能真正按照这样的方式度过你的早晨时光？
*/





//:[上一页](@previous)  |  第 13 页，共 14 页  |  [下一页：练习：恰当的名称](@next)
