/*:
 ## 练习：显示值
 
 你可能记得，前一个 playground 中的练习涉及到计算 iPhone 上的剩余空间。现有的信息如下：
 
 - iPhone 的容量以千兆字节 (GB) 计算。这部 iPhone 有 8GB 存储容量。
 - 1 千兆字节大约为 1,000 兆字节 (MB)。
 - 手机上已经存储了 3GB 资料。
 - 1 分钟的视频占用 150MB 空间。
 
 - callout(Exercise): (练习):\
 创建一个字符串，告诉用户手机上可以存储几分钟的视频。首先，需要执行计算步骤，然后使用字符串插值来显示答案，格式如下：
 
 `你可以再记录 XXX 分钟视频。`
 
 提示：执行所有计算时以兆字节为单位。
 */






/*:
 
 _Copyright © 2017 Apple Inc._
 
 _特此授予任何人免费获取本软件及相关文档文件（下文简称“本软件”）副本的权利，允许其无限制地处理本软件，包括但不限于使用、复制、修改、合并、发布、分发、再许可和/或出售本软件副本的权利，并允许本软件的合法用户这样做，但须符合以下条件：_
 
 _上述版权声明和本许可声明应包含在本软件的所有副本或主要部分中。_
 
 _本软件按其现状提供，不作任何明示或默示担保，包括但不限于对适销性、特定用途的适用性和不侵权的保证。在任何情况下，作者或版权所有者均不对因合同、侵权或其他由于使用或处理本软件而引起或与其相关的任何索赔、损害或其他责任负责。_
 */
//:[上一页](@previous)  |  第 16 页，共 16 页
