/*:
 ## 类型从哪里来？ 
 
 Swift 中内建有多种类型，代表所有程序的基本构造块。你已经用了很多时间来学习 `String` 和 `Int`，但是还有很多其他类型。
 
 它们都属于_“Swift 标准库”_。所有编程语言都有相似的地方——那就是执行基本编程任务所需的一系列基本功能。
 
 你已经用了很多时间来学习 `String` 和 `Int` 类型，但是还有很多其他类型。以下是 Swift 标准库中的一些其他类型。现在不用去管它们是什么意思，但是可以来猜一猜：
 
 - `Array`
 - `Dictionary`
 - `Set`
 - `Sequence`
 - `Error`
 - `Bool`
 
 请注意，所有类型名称都是以大写字母开头，即使是由多个单词构成，每个单词的第一个字母也都会大写。这与常量、变量和函数的命名规则稍有不同，它们都是以小写字母开头。
 
 这种区别是有意而为的。类型的名称以大写字母开头，这样一来就很容易将它们与函数、变量和常量的名称区别开来。它们都使用驼峰式拼写法，但是类型使用_大驼峰式拼写法_，而不是_小驼峰式拼写法_。
 
 - callout(Experiment):
 (体验):\
 想一些你自己的类型，然后想象一下使用大驼峰式拼写法将他们拼写出来的样子，如 `TrainingShoe` 或 `RacingBike`。 

 此外还有更多类型。我们将在下一页中找出它们从哪里来。
 
[上一页](@previous)  |  第 9 页，共 13 页  |  [下一页：标准库之外](@next)
*/
