/*:
 ## 练习：卡拉 ok 机

 你有个朋友非常喜欢跟一大群人一起唱卡拉 ok。唱卡拉 ok 的人会将他们喜欢的歌曲加入列表，卡拉 ok 机会将歌曲一首一首地调出来。 
 
 你的朋友请你帮助编写软件来协助管理歌曲列表。

 - callout(Exercise): (练习):\

 创建空数组，将歌名存放为字符串，并使用 `append` 方法添加三到四首歌曲，一次添加一首。
 */




/*:
 - callout(Exercise): (练习):\

 一位热情高涨的演唱者想一次添加三首歌曲。创建一个数组，存放这位演唱者的歌曲列表，并使用 `+=` 运算符，将整个列表附加到这组歌曲列表的结尾。
 */





/*:
 - callout(Exercise): (练习):\

 编写 `for...in` 循环，并针对数组中的每个歌名，打印鼓舞消息，让下一位演唱者知道就要轮到他了。
 */






/*:
 - callout(Exercise): (练习):\

 在循环让每一位演唱者都唱完之后，对歌曲列表使用 `removeAll` 方法，清除所有唱过的歌曲。
 */




//: [上一页](@previous)  |  第 14 页，共 17 页  |  [下一页：练习：计算投票数](@next)
