//: ## 宠物问题总结
//: 全部更新完成之后，playground 应如下所示：
// Number Of Dogs
6

// Number Of Cats
5

// Number Of Turtles
2

// Number Of Hamsters
1

// Total Number Of Animals
6 + 5 + 2 + 1

// Total Number Of Mammals
6 + 5 + 1
//: 用这种方法来使用 playground 肯定解决了你朋友的问题。你跟踪了每种动物的数量、动物总数和哺乳动物总数。
//:
//: 但是你在进行体验的时候，可能已经注意到这很容易出错。你必须更改多个地方的数字。一旦忘记更新每个地方的数字，总数就可能错。
//:
//: 你还必须记住哪个数字用来跟踪哪种动物。如果没有注释来标识每个数字，很难弄得清楚。
//:
//: 编写代码时最有用的一件事就是能够为事物命名。命名事物之后，就不用反复处理所有引用该事物的数字，只要在代码中所有需要使用该数字的地方使用该名称即可。
//:
//: 接下来，你将学习如何执行此操作。
//:
//:[上一页](@previous)  |  第 3 页，共 14 页  |  [下一页：命名事物](@next)
