/*:
 ## 常量和变量
 
在编程中，始终引用相同值的名称与值随时间变化的名称之间有很重要的区别。
 
 在现实世界中对事物进行命名时也有这种区别，只是通常不为人所注意。
 
 #### 常量
 
 以“你的生日”为例。你的生日永不会改变。无论你有多小，又或者变得多老，这个日期始终不变。即使数百年后，当人们阅读到你用绝妙的 app 改变世界的那些传奇的时候，你的生日仍不变。
 
 你的生日是常量。该值在你出生时设置一次，此后就不再改变。在代码中，你要将 `birthdate` 设置为常量。
 
 
 #### 变量
 
 人们日常使用的许多名称随着时间的推移可能具有不同的值。
 
 例如，想一想“你最喜爱的衬衫”或其他衣服。你还是小孩子的时候，可能有一件最喜爱的衬衫。随着年纪的增长，这件衬衫可能穿不下或者样式过时了，现在你又喜欢另一件衬衫了。将来，你可能还会再喜欢别的衬衫。你仍有“最喜爱的衬衫”这个名称或概念，但是，你实际所指的衬衫已经随时间变化了。在代码中，`favoriteShirt` 称为变量。
 
 #### 二者兼有
 在大多数类型的团队运动中，你总能同时看到一点常量和变量这两种概念。例如，所谓的“主队”和“客队”的概念。在你的学校，主队始终不变。对你的学校来说，它是常量。“客队”在名称或概念上没有变化，只是每场比赛的实际队伍是变化的。客队是变量。
 
- experiment:(体验):  \
 想一想生活中的常量和变量。从下面的列表入手：
  - 你的出生地
  - 你的居住地
  - 你的年龄
  - 你最喜爱的电影
  - 你脚的大小
  - 美国的第一任总统是谁

 */
//: [上一页](@previous)  |  第 2 页，共 13 页  |  [下一页：声明变量](@next)
