
/*:
 ## Hello

 `Print` 命令告诉 Swift 程序将信息发送到控制台。它可以与字符串搭配使用，如下所示：

`print("测试，一二三。")`

 现在，你可以制作要发送给控制台的第一条信息。大部分程序员无论是在学习第一种还是第五十种编程语言，都会选择从友好的“Hello”开始。
 
 但是，这不是一般意义上的问候。作为第一声问候，程序员通常会尽力用一种庄重的姿态去迎接整个世界。这就是本课前面所提到的那一历史悠久的传统。
 
 
 现在，就以一声欢快的“Hello, world!”向控制台致以问候吧。要真正参与这一仪式，你必须准确使用这两个词，但是你也可以根据自己喜欢的方式给它们加上标点。

- callout(体验：Hello, world):  
 如上述代码所示，键入 `print` 命令，并在括号中键入你自己的问候：“Hello, world!”。
 */

// Add your greeting just below this line, and watch it appear in the console:


/*:
 祝贺你！欢迎加入！单就一行代码来说，这似乎有些小题大做，但现在你已经走进了这悠久的编程传统。尽管将自己和屏幕一起自拍下来，留住这宝贵的瞬间。
*/
//: [上一页](@previous)  |  第 5 页，共 11 页  |  [下一页：来自程序员的消息](@next)
