/*:
 ## 练习：控制台 App
 
 哪些消息可以发送到控制台？
 
 你可以打开“访达”并前往“应用程序”>“实用工具”>“控制台”，看看其他程序员在你的 Mac 上打印的一些消息。你会看到一连串看似毫无意义的文本。这些都是开发者之间的私人消息，他们通常使用群内说法，这些说法只有非常熟悉每个 app 的人才能理解。
 
 滚动查看一些信息，然后退出“控制台”app。
 */
/*:
 
 _Copyright © 2017 Apple Inc._
 
 _特此授予任何人免费获取本软件及相关文档文件（下文简称“本软件”）副本的权利，允许其无限制地处理本软件，包括但不限于使用、复制、修改、合并、发布、分发、再许可和/或出售本软件副本的权利，并允许本软件的合法用户这样做，但须符合以下条件：_
 
 _上述版权声明和本许可声明应包含在本软件的所有副本或主要部分中。_
 
 _本软件按其现状提供，不作任何明示或默示担保，包括但不限于对适销性、特定用途的适用性和不侵权的保证。在任何情况下，作者或版权所有者均不对因合同、侵权或其他由于使用或处理本软件而引起或与其相关的任何索赔、损害或其他责任负责。_
 */
//: [上一页](@previous)  |  第 11 页，共 11 页
