/*:
## 隐藏结果边栏
 
还记得可靠的结果边栏，以及它是如何针对你所输入的任何计算自动显示答案的吗？ 👉 */
let sum = 1 + 2 + 3 + 4 + 5
let product = sum * sum

/*: 
 要继续秉承传统编程的精神，你需要隐藏该边栏。慢慢地将鼠标悬停在左边缘，直到光标变成双头箭头：
 
 ![调整光标的大小](resize-cursor.png)
 
 然后，点按并向右拖移该边界，直到该边栏完全无法显示任何计算结果为止。

   ![隐藏的 playground 结果窗口](xcode-results-hidden.png)
 
 再反复拖移开合该边栏几次，确保你以后会记得如何重新显示该边栏。
 
- callout(Experiment): (体验):\
  
 更改上面其中几个数字。将 5 更改为 23857，将 3 更改为 11，或者更改为其他数字。没有了结果边栏，你得猜猜结果会是多少。
 
 你怀念结果边栏吗？即使在这种老式环境中，你仍然可以使用一个强大的工具来观察程序的状态。

 翻到下一页去见识一下控制台吧。✨
 */
//: [上一页](@previous)  |  第 3 页，共 11 页  |  [下一页：控制台](@next)
