//: ## 注释
//: 程序员会在代码中留下简短备注来帮助说明代码。
//: 这能够帮助人们在稍后阅读代码时理解代码。
//: 这些备注称为 _“注释”_。
//:
//: playground 会忽略注释，因此注释不会影响代码的运行方式。
//: 
//: 注释以双斜线 `//` 开头：
// This is a comment; it does not affect the code
34 + 56 + 230
//: 由于系统不会处理注释，因此结果栏中不会显示该行代码的结果。
// 200 + 34 + 45
//: - experiment:(体验):\
//: 尝试在 `34 + 56 + 230` 计算前面添加双斜线，_“注释掉”_该计算。\
//:尝试删除双斜线，_“取消注释”_`200 + 34 + 45` 计算。\
//:编辑一些现有表达式并添加几个你自己的表达式。\
//:请注意，每次更改时，都会在边栏中更新结果。
//:
//: 做个深呼吸，然后移到下一页。
//:
//:[上一页](@previous)  |  第 4 页，共 7 页  |  [下一页：出问题时 😰](@next)
