/*:
 ## 控制台
 
 在触摸屏、鼠标和触控板出现之前，与电脑之间的互动完全是以文本为基础的。

 作为一名程序员，你可以走到幕后，在那里你会看到和执行一些一般用户不会看到和执行的事情。

 其中有一项称为“控制台”。

 如果你玩过视频游戏或者有电视台背景，可能会知道控制台这个词。但是在编程中，控制台是信息中心，可以显示有关程序运行的详细信息。

 #### 显示控制台
 要显示控制台，可以点按 Xcode 窗口左下角的这个按钮： ![控制台按钮](console_button.png)\
 或者点按 Xcode 窗口右上角的中间按钮： ![隐藏和显示面板按钮三套组](xcode-show-debug-area.png)
 
 练习显示和隐藏控制台几次，但完成时保留控制台处于显示状态。
 
 要调整控制台的高度，可以向上或向下拖移控制台顶部的栏。
   ![使用按钮显示和隐藏控制台的动画](show-hide-console.mov)
 */

 let charactersRemaining = 140 - 97
 let micTest = "开始了吗？"

/*:
 即使上述代码已运行，你也不会收到任何反馈。控制台是空的，因为只有当程序员发出打印指令时，控制台才会显示信息。
 
 进入下一页，完成步入编程者行列的仪式 🎓.
 */
//: [上一页](@previous)  |  第 4 页，共 11 页  |  [下一页：Hello](@next)
