/*:
 ## 不断重复
 
 到目前为止，你已经看过了许多 playground。在每一页上，代码都是从上到下运行，并在结果边栏中显示结果。
 
 你还学习了如何打印到控制台。以下代码将会打印童谣。打开控制台进行阅读。
*/
print("划呀划，划小船")
print("沿着溪流缓缓行")
print("多轻松，多高兴")
print("人生如梦不愿醒")
print("        ~        ")
print("划呀划，划小船")
print("沿着溪流缓缓行")
print("如果看见了鳄鱼")
print("不要忘记大声叫")
print("        ~        ")
print("划呀划，划小船")
print("沿着溪流缓缓行")
print("这首歌谣有很多重复的部分")
print("你能找出主旋律吗？")
/*:
 程序员要尽力避免两件事：
 - 不断重复
 - 不断重复
 
 多次编写相同的代码会为编写、理解和修复代码带来很多负担。 
 
 上面的代码有多少行是重复的？你要如何修复这一问题？去下一页中寻找答案。
 
 [上一页](@previous)  |  第 3 页，共 12 页  |  [下一页：单项工作](@next)
*/
