/*:
 ## 穿衣服
 
 想象一位朋友邀请你去看电影。你还没起床，于是回答：“在电影院见。我穿好衣服就去。”
 
 你朋友知道你说“穿衣服”是什么意思，但是不知道细节，比如，你会穿什么衬衫。
 
 现在，想一想你今天穿衣服的所有细节：决定穿什么、从衣柜或壁橱里拿出衣服、穿上每一件衣服。
 
 “穿衣服”这句话看似简单，但是当你仔细想想穿衣服所涉及的每个细节时，就会知道这三个字代表了很多复杂的内容。
 
 使用“穿衣服”这样一个短语让我们能够谈论和思考穿衣服的过程，而无需具体考虑每一个细节。
 
 这是人们一贯的行为和思维方式。例如，“去看牙医”、“做三明治”或“一起喝咖啡”这些短语，如果一步一步详细讨论它们所描述的活动，都是非常繁琐的。
 
 定义一个简单的方法来指代某个复杂的事件，这种思维方式就叫做*“抽象化”*。抽象化在软件开发中是一个基本概念。它将程序员从细节和复杂性的漩涡中解救出来。
 
 在本课中，你将学习如何定义和使用_“函数”_。在代码中，函数是定义抽象化的一种最基本的方法。
 
- experiment:(体验):  花几分钟思考一下其他代表更复杂的活动或概念的简单短语。

 接下来，我们来学习程序员还能够如何使用简单的短语来指代更加复杂的操作。
 
 第 1 页，共 12 页  |  [下一页：调用函数](@next)
 */
