/*:
 ## 关于实例
 
你已经学习了 Swift 中的类型，并已了解它们与现实世界中事物的类型极其相似。
 
现实世界中的每个类型都有许多实际的物理实例：
 
- 对于“汽车”类型，在路上有无数的个体差异，每个都有其自己的公里数、品牌、型号、颜色、油量、划痕和凹痕。每辆汽车还有本身特定的一套运行方式：启动、制动、换挡等方法。
 
 
- 对于“城市”类型，城市的每个实例都具有不同的名称、人口、位置和地标。一个城市有其特定的执行事务的方法，如响应紧急事件或垃圾收集等。
 
类型用于定义或描述特定事物类型的属性和行为。但是，类型的每个具体示例（每一辆车、每一个城市）却是该类型不同于其他的独立实例。
 
想象一下，有两辆汽车具有相同的品牌和型号，在同一年生产。一辆正在高速公路上快速奔驰；另一辆没油抛锚在路边。相同的类型，两个不同的实例。
 
或者，想想两个城市。每个城市的位置都不同。一个城市中的地标可能吸引许多观光客，而另一个城市中的地标却可能年久失修，几乎无人问津。同样是城市，但各个城市却可能彼此迥然不同。
 
在编程中，你可以创建和使用给定类型的不同实例。每个实例都有其自己的属性值集，且每个实例都可以独立于其他实例执行行为。
 
接下来，我们来看几个代码中的实例。
 
第 1 页，共 17 页  |  [下一页：实例](@next)
 */
